# GROUPBY

## Parameters :

   <b>by</b>: mapping, function, label, or list of labels. Used to determine the groups for the groupby.
     
   <b>axis</b> : {0 or ‘index’, 1 or ‘columns’}, default 0
     
   <b>level</b> : int , level name, or sequence of such, default None. If the axis is a MultiIndex (hierarchical), group by a particular level or levels.
     
   <b>as_index</b> : bool, default True. For aggregated output, return object with group labels as the index
     
   <b>sort</b>: bool, default True Sort group keys. Get better performance by turning this off. 
   
   <b>group_keys</b> : bool, default True When calling apply, add group keys to index to identify pieces.
   
   <b>squeeze</b> : bool, default False. Reduce the dimensionality of the return type if possible, otherwise return a consistent type.
   
   <b>observed</b> : bool, default False This only applies if any of the groupers are Categoricals. If True: only show observed values for categorical groupers. If False: show all values for categorical groupers.
   
  <b> dropna</b> : bool, default True If True, and if group keys contain NA values, NA values together with row/column will be dropped. If False, NA values will also be treated as the key in groups.
  
  
## Returns : <b>DataFrameGroupBy</b>
   
    Returns a groupby object that contains information about the groups.

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [16]:
df1 = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

In [17]:
df1

     A      B         C         D
0  foo    one  1.092516  1.478582
1  bar    one -1.129831 -1.226270
2  foo    two -1.450480 -0.013718
3  bar  three -0.405858 -2.560164
4  foo    two  0.254187  1.286917
5  bar    two -3.032784 -0.672705
6  foo    one -0.593342  0.588138
7  foo  three -0.772011  1.911888

In [18]:
df1.groupby('A') #gives its place in memory

In [20]:
df1.groupby('A').mean() # we have to use method for give an output

            C         D
A
bar -1.522824 -1.486379
foo -0.293826  1.050361

In [38]:
df1.groupby('A').C.mean() #only C column

A
bar   -1.522824
foo   -0.293826
Name: C, dtype: float64

In [49]:
df1.groupby(['A','B']).C.min() #we have to use [] for multi index

A    B
bar  one     -1.129831
     three   -0.405858
     two     -3.032784
foo  one     -0.593342
     three   -0.772011
     two     -1.450480
Name: C, dtype: float64

In [54]:
df1.groupby(['A','B'],level=0).C.mean()

0    1.092516
1   -1.129831
2   -1.450480
3   -0.405858
4    0.254187
5   -3.032784
6   -0.593342
7   -0.772011
Name: C, dtype: float64

In [71]:
dict2 = {'A': ['a', 'a', 'c', 'b', 'b', 'b'], 'B' : [2,6,9,6,5,8,] }
df2=pd.DataFrame(dict2)
df2

   A  B
0  a  2
1  a  6
2  c  9
3  b  6
4  b  5
5  b  8

In [74]:
df2.groupby(['A'],sort=True).sum() # sort group keys default=True

    B
A
a   8
b  19
c   9

In [73]:
df2.groupby(['A'],sort=False).sum()

    B
A
a   8
c   9
b  19

In [75]:
df_list = [[1, 2, 3], [1, None, 4], [2, 1, 3], [1, 2, 2]]
df3=pd.DataFrame(df_list, columns=['a','b','c'])
df3

   a    b  c
0  1  2.0  3
1  1  NaN  4
2  2  1.0  3
3  1  2.0  2

In [77]:
df3.groupby(by='b',dropna=True).sum() #Default ``dropna`` is set to True

     a  c
b
1.0  2  3
2.0  2  5

In [78]:
df3.groupby(by='b',dropna=False).sum() #it allows NaN in keys

     a  c
b
1.0  2  3
2.0  2  5
NaN  1  4

### Groups Attribute

In [81]:
df3.groupby('b').groups #return each group's index

{1.0: [2], 2.0: [0, 3]}

In [84]:
df1

     A      B         C         D
0  foo    one  1.092516  1.478582
1  bar    one -1.129831 -1.226270
2  foo    two -1.450480 -0.013718
3  bar  three -0.405858 -2.560164
4  foo    two  0.254187  1.286917
5  bar    two -3.032784 -0.672705
6  foo    one -0.593342  0.588138
7  foo  three -0.772011  1.911888

In [83]:
df1.groupby(['A','B']).groups

{('bar', 'one'): [1], ('bar', 'three'): [3], ('bar', 'two'): [5], ('foo', 'one'): [0, 6], ('foo', 'three'): [7], ('foo', 'two'): [2, 4]}

 ### GroupBy with MultiIndex

In [86]:
arrays = [
    ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
    ["one", "two", "one", "two", "one", "two", "one", "two"],
]
index = pd.MultiIndex.from_arrays(arrays, names=["first", "second"]) #create multiindex by manually
s1 = pd.Series(np.random.randn(8), index=index)
s1

first  second
bar    one      -0.481000
       two       0.157187
baz    one      -0.539486
       two      -1.900822
foo    one      -2.883937
       two      -0.165655
qux    one       0.616833
       two      -0.903004
dtype: float64

In [87]:
s1.groupby(level=0).sum() # we use level attribute

first
bar   -0.323814
baz   -2.440308
foo   -3.049592
qux   -0.286172
dtype: float64

In [88]:
s1.groupby(level=1).sum()

second
one   -3.287591
two   -2.812295
dtype: float64

In [89]:
s1.groupby(level='second').sum() #we can write index name

second
one   -3.287591
two   -2.812295
dtype: float64

In [91]:
s1.groupby(level=["first", "second"]).sum()

first  second
bar    one      -0.481000
       two       0.157187
baz    one      -0.539486
       two      -1.900822
foo    one      -2.883937
       two      -0.165655
qux    one       0.616833
       two      -0.903004
dtype: float64

### DataFrame column selection in GroupBy

In [92]:
data = {'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'GOOG', 'MSFT', 'GOOG', 'MSFT'],
        'Department':['HR', 'IT', 'IT', 'HR', 'HR', 'IT', 'IT', 'HR'],
        'Person':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah', 'Tom', 'Terry'],
        'Age':[30, 28, 35, 40, 42, 25, 32, 48],
        'Sales':[200, 120, 340, 124, 243, 350, 180, 220]}
df4=pd.DataFrame(data)
df4

  Company Department   Person  Age  Sales
0    GOOG         HR      Sam   30    200
1    GOOG         IT  Charlie   28    120
2    MSFT         IT      Amy   35    340
3    MSFT         HR  Vanessa   40    124
4    GOOG         HR     Carl   42    243
5    MSFT         IT    Sarah   25    350
6    GOOG         IT      Tom   32    180
7    MSFT         HR    Terry   48    220

In [94]:
df4.groupby('Company')['Sales'].mean() # we get the output type of series

Company
GOOG    185.75
MSFT    258.50
Name: Sales, dtype: float64

In [95]:
df4.groupby('Company')[['Sales']].mean() # if we will use [] then output is dataframe

          Sales
Company
GOOG     185.75
MSFT     258.50

In [97]:
df4.groupby('Company').Person.count() #We grouped the number of employees by company

Company
GOOG    4
MSFT    4
Name: Person, dtype: int64

In [98]:
df4.groupby(['Company','Department']).mean() #We did multiindex with groupby

                     Age  Sales
Company Department
GOOG    HR          36.0  221.5
        IT          30.0  150.0
MSFT    HR          44.0  172.0
        IT          30.0  345.0

In [99]:
df4.groupby(['Company','Department'])['Sales'].describe()

                    count   mean        std    min     25%    50%     75%  \
Company Department
GOOG    HR            2.0  221.5  30.405592  200.0  210.75  221.5  232.25
        IT            2.0  150.0  42.426407  120.0  135.00  150.0  165.00
MSFT    HR            2.0  172.0  67.882251  124.0  148.00  172.0  196.00
        IT            2.0  345.0   7.071068  340.0  342.50  345.0  347.50

                      max
Company Department
GOOG    HR          243.0
        IT          180.0
MSFT    HR          220.0
        IT          350.0

### .aggregate() / agg()

In [101]:
animals = pd.DataFrame(
    {
        "kind": ["cat", "dog", "cat", "dog"],
        "height": [9.1, 6.0, 9.5, 34.0],
        "weight": [7.9, 7.5, 9.9, 198.0],
    }
)
animals

  kind  height  weight
0  cat     9.1     7.9
1  dog     6.0     7.5
2  cat     9.5     9.9
3  dog    34.0   198.0

In [102]:
animals.groupby('kind').agg(min_height=pd.NamedAgg('height',aggfunc=min))

      min_height
kind
cat          9.1
dog          6.0

In [103]:
animals.groupby('kind').agg(max_height=pd.NamedAgg('height',aggfunc=max)) #I named the column by saying max_height

      max_height
kind
cat          9.5
dog         34.0

In [105]:
animals.groupby('kind').height.agg(min)

kind
cat    9.1
dog    6.0
Name: height, dtype: float64

In [108]:
animals.groupby('kind').agg(min_height=pd.NamedAgg('height',aggfunc=min),
                           max_height=pd.NamedAgg('height',aggfunc=max),
                           avg_height=pd.NamedAgg('height',aggfunc='mean'))

      min_height  max_height  avg_height
kind
cat          9.1         9.5         9.3
dog          6.0        34.0        20.0

In [109]:
df5 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10, 23, 33, 22, 11, 99, 76, 84, 45],
                   'var2': [100, 253, 333, 262, 111, 969, 405, 578, 760]})
df5

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969
6      A    76   405
7      B    84   578
8      C    45   760

In [112]:
df5.agg([sum,min]) #evey character has a ascii code (min)

        groups  var1  var2
sum  ABCABCABC   403  3771
min          A    10   100

In [114]:
df5.groupby('groups').agg([sum, 'mean', np.median]) #agg() method more flexibility it can take string function

       var1                    var2
        sum       mean median   sum        mean median
groups
A       108  36.000000   22.0   767  255.666667  262.0
B       118  39.333333   23.0   942  314.000000  253.0
C       177  59.000000   45.0  2062  687.333333  760.0

In [115]:
df5.groupby('groups').agg({'var1': min, 'var2': max}) # we can use dict with agg function

        var1  var2
groups
A         10   405
B         11   578
C         33   969

In [116]:
df5.groupby('groups').agg({'var1':[min,max], 'var2':[sum]}) # we can assign more than one function to a column

       var1      var2
        min max   sum
groups
A        10  76   767
B        11  84   942
C        33  99  2062

In [123]:
df5.groupby('groups').var1.agg([min,max,sum]) # we can assign specific column

        min  max  sum
groups
A        10   76  108
B        11   84  118
C        33   99  177